//Задание 3.
// Считать стороны a, b, c. Проверить положительность и существование треугольника.
// Если существует — определить его вид: равносторонний, равнобедренный или разносторонний.

#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");

    double a, b, c;

    cout << "Введите сторону a: ";
    cin >> a;
    cout << "Введите сторону b: ";
    cin >> b;
    cout << "Введите сторону c: ";
    cin >> c;

   
    if (a <= 0 || b <= 0 || c <= 0) {
        cout << "Ошибка: стороны должны быть положительными числами!" << endl;
    }
   
    else if (a + b > c && a + c > b && b + c > a) {
        // Если существует — определяем вид
        if (a == b && b == c) {
            cout << "Треугольник равносторонний" << endl;
        }
        else if (a == b || b == c || a == c) {
            cout << "Треугольник равнобедренный" << endl;
        }
        else {
            cout << "Треугольник разносторонний" << endl;
        }
    }
    else {
        cout << "Треугольник не существует" << endl;
    }

    return 0;
}
